# BumpmapBitmap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BumpMap..::..BumpmapBitmap Property
BumpMap Class See Also
---
The property labeled "Source" from the "BumpMap" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string BumpmapBitmap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BumpmapBitmap As String
	Get
```

Visual C++
---
```text
public:
static property String^ BumpmapBitmap {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyString" and will contain a relative path.
# See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace